Seminario/latex_beamer/slides.org
#+title: Giochi di Banach-Mazur
#+author: Davide Peccioli
#+date: 4 giugno 2025

#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [babel]
#+BEAMER_THEME: CambridgeUS
#+BEAMER_COLOR_THEME: spruce
#+BEAMER_FONT_THEME: professionalfonts
#+LaTeX_HEADER: \institute[]{Università degli Studi di Torino}
#+LaTeX_HEADER: \input{header_beamer.tex}
#+LaTeX_HEADER: \hypersetup{pdfpagemode=FullScreen}
#+OPTIONS: H:2 toc:nil
#+LATEX_HEADER: \renewcommand{\href}[2]{#2}

* Teoria dei Giochi

** Gioco Logico

*** Definizione 1.1
:PROPERTIES:
:BEAMER_env: block
:END:

Un _gioco logico_ è una quadrupla \(\mathcal{G} \coloneqq (\Omega, f, W_{\text{I}}, W_{\text{II}})\) dove:
- \(\Omega\) è un [[id:76c41141-40b1-420e-89bc-6da6d94d2509][insieme]], chiamato il _dominio del gioco_;
- \(f:\Omega^{<\omega}\to \set{\text{I},\text{II}}\) è una [[id:40832c72-9f3d-442f-b03a-d8a1ae32774f][funzione]], chiamata _funzione di turno_ o _funzione del giocatore_;
- \(W_{\text{I}},W_{\text{II}} \subseteq \Omega^{<\omega}\cup \Omega^{\omega}\) sono tali che
  a. \(W_{\text{I}}\cap W_{\text{II}} = \emptyset\);
  b. per ogni \(\bm{a} \in W_{\bullet}\) e per ogni \(\bm{b} \in\Omega^{<\omega}\cup \Omega^{\omega}\):
  \begin{equation*}
	\bm{a} \subseteq \bm{b}\quad\implies\quad \bm{b} \in W_{\bullet}
  \end{equation*}

Gli elementi di \(\Omega^{<\omega}\) sono chiamati _posizioni del gioco_ \(\mathcal{G}\), mentre un elemento di \(\Omega^{\omega}\) è detto _giocata_ di \(\mathcal{G}\).

** DA TOGLIERE

I giocatori I e II giocano scegliendo a turno elementi di \(\Omega\). La funzione di turno \(f\) associa a ciascuna posizione uno dei due giocatori: se
\begin{equation*}
f(a_{0},a_{1},\dots,a_{n}) = \text{I}
\end{equation*}
allora l'elemento \(a_{n+1}\) sarà scelto dal giocatore I.

Si dirà che il giocatore I _vince la giocata \(\bm{a}\)_ se \(\bm{a} \in W_{\text{I}}\); si dirà che il giocatore II _vince la giocata \(\bm{b}\)_ se \(\bm{b} \in W_{\text{II}}\).

*** Definizione 1.2
:PROPERTIES:
:BEAMER_env: block
:END:

Un gioco è detto _totale_ se \(\Omega^{\omega} \subseteq W_{\text{I}}\cup W_{\text{II}}\).

** Strategia per un gioco logico

Una strategia per un giocatore è un insieme di regole che descrivono esattamente come un giocatore debba giocare, in base a tutte le mosse precedenti.

Una strategia è dettoa _vincente_ per un giocatore se questo vince ogni giocata in cui ne fa uso, a prescindere dalle mosse dell'altro giocatore.

*** Definizione 1.4
:PROPERTIES:
:BEAMER_env: block
:END:

Un gioco si dice _determinato_ se esiste una strategia vincente per I o per II.

** Giochi logici equivalenti

*** Definizione 1.5
:PROPERTIES:
:BEAMER_env: block
:END:

Due [[id:90b2021f-dbe8-499f-8c79-32379384fdb8][giochi logici]] \(\mathcal{G}\) e \(\mathcal{G'}\) con giocatori I e II sono detti _equivalenti_ se sono soddisfate entrambe le seguenti ipotsi:
a. esiste una [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][strategia vincente]] per I in \(\mathcal{G}\) sse esiste una [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][strategia vincente]] per I in \(\mathcal{G}'\)
b. esiste una [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][strategia vincente]] per II in \(\mathcal{G}\) sse esiste una [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][strategia vincente]] per II in \(\mathcal{G}'\)

** Giochi di Gale-Stewart

*** Definizione 1.6
:PROPERTIES:
:BEAMER_env: block
:END:

Sia \(A\) un [[id:76c41141-40b1-420e-89bc-6da6d94d2509][insieme]] non vuoto, e sia \(C \subseteq A^{\omega}\). Si definisce il _gioco di Gale-Stewart_ associato ad \(C\) come il [[id:90b2021f-dbe8-499f-8c79-32379384fdb8][gioco logico]] seguente:
\begin{equation*}
G(A,C) = G(A) \coloneqq (A, \psi, C, A^{\omega}\setminus C)
\end{equation*}
dove la [[id:40832c72-9f3d-442f-b03a-d8a1ae32774f][funzione]] \(\psi: A^{<\omega}\to \set{\text{I},\text{II}}\) è così definita
\begin{equation*}
\psi(s) \coloneqq \begin{cases}
\text{I} & \operatorname{lh}(s)\text{ è pari}\\
\text{II} & \operatorname{lh}(s)\text{ è dispari}
\end{cases}
\end{equation*}

** DA TOGLIERE

Pertanto il gioco può essere codificato come segue:
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {a_0} \&\& {a_2} \&\& {a_4} \&\& \dots \\
	{\text{II}} \&\& {a_1} \&\& {a_3} \&\& \dots
\end{tikzcd}
\end{equation*}
e il giocatore I vince se e solo se \((a_{n})_{n \in \omega} \in C\).

** Strategia per un gioco di Gale-Stewart
Si specializza la definizione di [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][strategia per un gioco logico]] al caso particolare di un gioco di Gale-Stewart.

Una strategia per un gioco \(G(A,C)\) è un [[id:f6a088d6-177a-4efe-94de-06619dfaa3ec][albero]] \(\sigma \subseteq A^{<\omega}\) tale che:
   a. \(\sigma\) sia [[id:a2f6fcaa-d386-4adb-a8b8-34e590e42140][potato]] e non vuoto;

   b. se \(\langle a_{0},\dots,a_{2j}\rangle \in \sigma\) allora per ogni \(a_{2j+1} \in A\): \(\langle a_{0},\dots,a_{2j+1}\rangle \in \sigma\);

   c. se \(\langle a_{0},\dots,a_{2j-1}\rangle \in \sigma\) allora esiste un unico \(a_{2j} \in A\) tale che \(\langle a_{0},\dots,a_{2j}\rangle \in \sigma\).

Una strategia è detta _vincente_ se il suo [[id:8338ba93-b2e9-4671-9097-4c88f5b51d46][corpo]] \([\sigma] \in A\).

** Gioco di Gale-Stewart con posizioni ammissibili

Spesso è comodo considerare giochi in cui I e II non possano giocare ogni elemento di \(A\), ma debbano seguire delle _regole_. Quindi, è necessario dare un alberto potato non vuoto \(T \subseteq A^{<\omega}\), che determina le [[id:3fa552b8-abc8-4a29-9f39-144dd774974d][_posizioni ammissibili_]].

In questa situazione I e II si alternano giocando \(\langle a_{0},\dots,a_{n},\dots,\rangle\) in maniera tale che, ad ogni passo \(n \in \omega\)
\begin{equation*}
\langle a_{0},\dots,a_{n}\rangle \in T
\end{equation*}

Si scriverà, in questo caso, \(G(T, C)\).

** Teorema di Gale-Stewart

Sia \(A\) uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] [[id:6d05dcb7-b447-4583-91f0-9f3228435c27][discreto]] e sia \(A^{\omega}\) dotato della [[id:88fa98ee-2e42-41b3-b12e-b7a4075399da][topologia prodotto]].

*** Teorema di Gale-Stewart 1.7
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Sia \(T\) un [[id:f6a088d6-177a-4efe-94de-06619dfaa3ec][albero]] [[id:a2f6fcaa-d386-4adb-a8b8-34e590e42140][potato]] non vuoto su \(A\). Se \(C \subseteq [T]\) è [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][aperto]] o [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][chiuso]] in \([T]\), allora [[id:20f27458-a0b1-4721-bd7b-04d5e882308f][il gioco]] \(G(T,C)\) è [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][determinato]].

* Insiemi Analitici e BP

** Gioco di Choquet

*** Definizione 2.1
:PROPERTIES:
:BEAMER_env: block
:END:

Sia \((X,\tau)\) uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] non vuoto. Il gioco di Choquet \(G_{X}\) è un [[id:90b2021f-dbe8-499f-8c79-32379384fdb8][gioco]] [[id:118a42bc-7263-46fd-92c5-85c108080240][di Gale-Stewart]] totale codificato come segue: i giocatori I e II si alternano scegliendo sottoinsiemi aperti non vuoti di \(X\):
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {U_0} \&\& {U_1} \&\& {U_2} \&\& \cdots \\
	{\text{II}} \&\& {V_0} \&\& {V_1} \&\& \cdots
\end{tikzcd}
\end{equation*}
tali che \(U_{0} \supseteq V_{0}\supseteq U_{1}\supseteq V_{1}\supseteq \dots\)

Il giocatore II vince se
\begin{equation*}
\bigcap_{n \in \omega} V_{n} = \bigcap_{n \in \omega} U_{n} \neq \emptyset.
\end{equation*}

** DA TOGLIERE

*** Teorema 2.2
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] \(X\) è uno [[id:6232eb32-a530-4c1b-aefc-403acfd7c057][spazio topologico di Baire]] se e solo se il giocatore I _non ha una [[id:25fecfe5-10ce-4072-bba1-12024479dbca][strategia]] [[id:25fecfe5-10ce-4072-bba1-12024479dbca][vincente]]_ nel [[id:eafe31ae-c3a4-4c01-97e0-a6848b6a6dc6][gioco di Choquet]] \(G_{X}\).

