Seminario/latex_beamer/slides.tex
% Created 2025-05-30 Fri 16:56
% Intended LaTeX compiler: pdflatex
\documentclass[babel]{beamer}

\institute[]{Università degli Studi di Torino}
\input{header_beamer.tex}
\hypersetup{pdfpagemode=FullScreen}
\renewcommand{\href}[2]{#2}
\usetheme{CambridgeUS}
\usecolortheme{spruce}
\usefonttheme{professionalfonts}
\author{Davide Peccioli}
\date{4 giugno 2025}
\title{Giochi di Banach-Mazur}
\begin{document}

\maketitle
\section{Teoria dei Giochi}
\label{sec:org2700ea0}

\begin{frame}[label={sec:orgb34398e}]{Gioco Logico}
\begin{block}{Definizione 1.1}
Un \uline{gioco logico} è una quadrupla \(\mathcal{G} \coloneqq (\Omega, f, W_{\text{I}}, W_{\text{II}})\) dove:
\begin{itemize}
\item \(\Omega\) è un \href{../../../../../../../org/roam/20250130104331-insieme_mk.org}{insieme}, chiamato il \uline{dominio del gioco};
\item \(f:\Omega^{<\omega}\to \set{\text{I},\text{II}}\) è una \href{../../../../../../../org/roam/20250202170607-classe_relazione_binaria.org}{funzione}, chiamata \uline{funzione di turno} o \uline{funzione del giocatore};
\item \(W_{\text{I}},W_{\text{II}} \subseteq \Omega^{<\omega}\cup \Omega^{\omega}\) sono tali che
\begin{enumerate}
\item \(W_{\text{I}}\cap W_{\text{II}} = \emptyset\);
\item per ogni \(\bm{a} \in W_{\bullet}\) e per ogni \(\bm{b} \in\Omega^{<\omega}\cup \Omega^{\omega}\):
\end{enumerate}
\begin{equation*}
  \bm{a} \subseteq \bm{b}\quad\implies\quad \bm{b} \in W_{\bullet}
\end{equation*}
\end{itemize}

Gli elementi di \(\Omega^{<\omega}\) sono chiamati \uline{posizioni del gioco} \(\mathcal{G}\), mentre un elemento di \(\Omega^{\omega}\) è detto \uline{giocata} di \(\mathcal{G}\).
\end{block}
\end{frame}
\begin{frame}[label={sec:orgae23e0b}]{DA TOGLIERE}
I giocatori I e II giocano scegliendo a turno elementi di \(\Omega\). La funzione di turno \(f\) associa a ciascuna posizione uno dei due giocatori: se
\begin{equation*}
f(a_{0},a_{1},\dots,a_{n}) = \text{I}
\end{equation*}
allora l'elemento \(a_{n+1}\) sarà scelto dal giocatore I.

Si dirà che il giocatore I \uline{vince la giocata \(\bm{a}\)} se \(\bm{a} \in W_{\text{I}}\); si dirà che il giocatore II \uline{vince la giocata \(\bm{b}\)} se \(\bm{b} \in W_{\text{II}}\).
\begin{block}{Definizione 1.2}
Un gioco è detto \uline{totale} se \(\Omega^{\omega} \subseteq W_{\text{I}}\cup W_{\text{II}}\).
\end{block}
\end{frame}
\begin{frame}[label={sec:orgaa22a57}]{Strategia per un gioco logico}
Una strategia per un giocatore è un insieme di regole che descrivono esattamente come un giocatore debba giocare, in base a tutte le mosse precedenti.

Una strategia è dettoa \uline{vincente} per un giocatore se questo vince ogni giocata in cui ne fa uso, a prescindere dalle mosse dell'altro giocatore.
\begin{block}{Definizione 1.4}
Un gioco si dice \uline{determinato} se esiste una strategia vincente per I o per II.
\end{block}
\end{frame}
\begin{frame}[label={sec:org84dbf4e}]{Giochi logici equivalenti}
\begin{block}{Definizione 1.5}
Due \href{../../../../../../../org/roam/20250513155732-logic_game.org}{giochi logici} \(\mathcal{G}\) e \(\mathcal{G'}\) con giocatori I e II sono detti \uline{equivalenti} se sono soddisfate entrambe le seguenti ipotsi:
\begin{enumerate}
\item esiste una \href{../../../../../../../org/roam/20250513155732-logic_game.org}{strategia vincente} per I in \(\mathcal{G}\) sse esiste una \href{../../../../../../../org/roam/20250513155732-logic_game.org}{strategia vincente} per I in \(\mathcal{G}'\)
\item esiste una \href{../../../../../../../org/roam/20250513155732-logic_game.org}{strategia vincente} per II in \(\mathcal{G}\) sse esiste una \href{../../../../../../../org/roam/20250513155732-logic_game.org}{strategia vincente} per II in \(\mathcal{G}'\)
\end{enumerate}
\end{block}
\end{frame}
\begin{frame}[label={sec:org6590236}]{Giochi di Gale-Stewart}
\begin{block}{Definizione 1.6}
Sia \(A\) un \href{../../../../../../../org/roam/20250130104331-insieme_mk.org}{insieme} non vuoto, e sia \(C \subseteq A^{\omega}\). Si definisce il \uline{gioco di Gale-Stewart} associato ad \(C\) come il \href{../../../../../../../org/roam/20250513155732-logic_game.org}{gioco logico} seguente:
\begin{equation*}
G(A,C) = G(A) \coloneqq (A, \psi, C, A^{\omega}\setminus C)
\end{equation*}
dove la \href{../../../../../../../org/roam/20250202170607-classe_relazione_binaria.org}{funzione} \(\psi: A^{<\omega}\to \set{\text{I},\text{II}}\) è così definita
\begin{equation*}
\psi(s) \coloneqq \begin{cases}
\text{I} & \operatorname{lh}(s)\text{ è pari}\\
\text{II} & \operatorname{lh}(s)\text{ è dispari}
\end{cases}
\end{equation*}
\end{block}
\end{frame}
\begin{frame}[label={sec:org922f952}]{DA TOGLIERE}
Pertanto il gioco può essere codificato come segue:
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {a_0} \&\& {a_2} \&\& {a_4} \&\& \dots \\
	{\text{II}} \&\& {a_1} \&\& {a_3} \&\& \dots
\end{tikzcd}
\end{equation*}
e il giocatore I vince se e solo se \((a_{n})_{n \in \omega} \in C\).
\end{frame}
\begin{frame}[label={sec:orge77dc7e}]{Strategia per un gioco di Gale-Stewart}
Si specializza la definizione di \href{../../../../../../../org/roam/20250513155732-logic_game.org}{strategia per un gioco logico} al caso particolare di un gioco di Gale-Stewart.

Una strategia per un gioco \(G(A,C)\) è un \href{../../../../../../../org/roam/20250514142154-albero_teoria_descrittiva_degli_insiemi.org}{albero} \(\sigma \subseteq A^{<\omega}\) tale che:
\begin{enumerate}
\item \(\sigma\) sia \href{../../../../../../../org/roam/20250514142208-albero_potato.org}{potato} e non vuoto;

\item se \(\langle a_{0},\dots,a_{2j}\rangle \in \sigma\) allora per ogni \(a_{2j+1} \in A\): \(\langle a_{0},\dots,a_{2j+1}\rangle \in \sigma\);

\item se \(\langle a_{0},\dots,a_{2j-1}\rangle \in \sigma\) allora esiste un unico \(a_{2j} \in A\) tale che \(\langle a_{0},\dots,a_{2j}\rangle \in \sigma\).
\end{enumerate}

Una strategia è detta \uline{vincente} se il suo \href{../../../../../../../org/roam/20250514142251-corpo_di_un_albero.org}{corpo} \([\sigma] \in A\).
\end{frame}
\begin{frame}[label={sec:orgcb9539c}]{Gioco di Gale-Stewart con posizioni ammissibili}
Spesso è comodo considerare giochi in cui I e II non possano giocare ogni elemento di \(A\), ma debbano seguire delle \uline{regole}. Quindi, è necessario dare un alberto potato non vuoto \(T \subseteq A^{<\omega}\), che determina le \href{../../../../../../../org/roam/20250514142938-posizioni_ammissibili_in_un_gioco_logico.org}{\uline{posizioni ammissibili}}.

In questa situazione I e II si alternano giocando \(\langle a_{0},\dots,a_{n},\dots,\rangle\) in maniera tale che, ad ogni passo \(n \in \omega\)
\begin{equation*}
\langle a_{0},\dots,a_{n}\rangle \in T
\end{equation*}

Si scriverà, in questo caso, \(G(T, C)\).
\end{frame}
\begin{frame}[label={sec:org0524566}]{Teorema di Gale-Stewart}
Sia \(A\) uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} \href{../../../../../../../org/roam/20250317165247-topologia_discreta.org}{discreto} e sia \(A^{\omega}\) dotato della \href{../../../../../../../org/roam/20250109154723-topologia_prodotto.org}{topologia prodotto}.
\begin{alertblock}{Teorema di Gale-Stewart 1.7}
Sia \(T\) un \href{../../../../../../../org/roam/20250514142154-albero_teoria_descrittiva_degli_insiemi.org}{albero} \href{../../../../../../../org/roam/20250514142208-albero_potato.org}{potato} non vuoto su \(A\). Se \(C \subseteq [T]\) è \href{../../../../../../../org/roam/20250103145124-topologia.org}{aperto} o \href{../../../../../../../org/roam/20250103145124-topologia.org}{chiuso} in \([T]\), allora \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{il gioco} \(G(T,C)\) è \href{../../../../../../../org/roam/20250513155732-logic_game.org}{determinato}.
\end{alertblock}
\end{frame}
\section{Insiemi Analitici e BP}
\label{sec:org78afcc0}
