Seminario/latex_beamer/slides.org
*** Definizione 2.3
:PROPERTIES:
:BEAMER_env: block
:END:

Uno spazio topologico \(X\) è detto _spazio di Choquet_ se il giocatore II ha una strategia vincente in \(G_{X}\).

*** DA TOGLIERE
In particolare, ogni spazio Polacco è uno spazio di Choquet.

** Gioco di Banach-Mazur

Sia \(X\) uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] non vuoto, e sia \(A \subseteq X\).

*** Definizione 2.5
:PROPERTIES:
:BEAMER_env: block
:END:

Il _gioco di Banach-Mazur_ (o anche **-gioco) di \(A\), denotato con \(G^{ * *}(A)\) oppure con \(G^{ * *}(A,X)\) è un [[id:90b2021f-dbe8-499f-8c79-32379384fdb8][gioco]] [[id:118a42bc-7263-46fd-92c5-85c108080240][di Gale-Stewart]] codificato come segue: i giocatori I e II si alternano scegliendo sottoinsiemi aperti non vuoti di \(X\)
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {U_0} \&\& {U_1} \&\& {U_2} \&\& \cdots \\
	{\text{II}} \&\& {V_0} \&\& {V_1} \&\& \cdots
\end{tikzcd}
\end{equation*}
[[id:20f27458-a0b1-4721-bd7b-04d5e882308f][tali che]] \(U_{0}\supseteq V_{0}\supseteq U_{1}\supseteq V_{1}\supseteq \dots\)

Il giocatore II vince se
\begin{equation*}
\bigcap_{n \in \omega} U_{n} = \bigcap_{n \in \omega} V_{n} \subseteq A.
\end{equation*}

** DA TOGLIERE

*** Teorema 2.6
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Sia \(X\) uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] [[id:259b30b8-3c7e-407f-a372-95199bd724fa][non vuoto]], e sia \(A \subseteq X\) un [[id:fdc86b04-828f-4f24-8cdf-948211d93a95][sottoinsieme]] qualsiasi. Allora \(A\) è [[id:41953408-de97-4240-bed0-37f9de8706c4][comagro]] se e solo se il giocatore II ha una [[id:25fecfe5-10ce-4072-bba1-12024479dbca][strategia vincente]] nel [[id:00eb3064-f9f9-47c4-9eac-473caaf438a7][gioco di Banach-Mazur]] \(G^{**}(A)\).

*** Teorema 2.7
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Se \(X\) è uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] [[id:5db440b3-d225-491e-95e4-c365595a2bca][di Choquet]] non [[id:259b30b8-3c7e-407f-a372-95199bd724fa][vuoto]] ed esiste una [[id:59033095-a7ca-4c79-92a9-c93654eb71f3][distanza]] \(d\) su \(X\) le cui [[id:ea05d3e0-5aaa-4958-9802-97dd1258ef27][palle aperte]] sono aperti di \(X\), allora:

\(A\) è [[id:41953408-de97-4240-bed0-37f9de8706c4][magro]] in un [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][aperto]] non vuoto se e solo se il giocatore I ha una [[id:25fecfe5-10ce-4072-bba1-12024479dbca][strategia vincente]] nel [[id:00eb3064-f9f9-47c4-9eac-473caaf438a7][gioco di Banach-Mazur]] \(G^{**}(A)\).

** DA TOGLIERE

Dimostrazione Teorema 2.6/2.7???

** DA TOGLIERE

*** Lemma 2.8
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Sia \(X\) uno [[id:0739c4de-6fe4-43d3-bca9-33455ef06da8][spazio topologico]] [[id:5db440b3-d225-491e-95e4-c365595a2bca][di Choquet]] non [[id:259b30b8-3c7e-407f-a372-95199bd724fa][vuoto]] tale che esista una [[id:59033095-a7ca-4c79-92a9-c93654eb71f3][distanza]] \(d\) su \(X\) le cui [[id:ea05d3e0-5aaa-4958-9802-97dd1258ef27][palle aperte]] sono aperti di \(X\). Sia \(A \subseteq X\).

Se per ogni aperto \(U \subseteq X\) il [[id:00eb3064-f9f9-47c4-9eac-473caaf438a7][gioco]] \(G^{**}\left((X\setminus A)\cup U\right)\) è [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][determinato]] allora \(A \subseteq X\) ha [[id:a18bc557-1ac7-4d19-8cd8-ad3923e1a68f][BP]].

** DA TOGLIERE

*** Definizione 2.9
:PROPERTIES:
:BEAMER_env: block
:END:

Una _base debole_ per uno spazio topologico \((X,\tau)\) è una collezione di aperti \(\set{A_{\alpha}}_{\alpha \in \Omega} \subseteq \tau\) tali che, per ogni aperto non vuoto di \(X\), \(\emptyset\neq U \subseteq X\) esista \(\alpha_{0} \in \Omega\) tale che
\begin{equation*}
A_{\alpha_{0}} \subseteq U.
\end{equation*}

** Gioco di Banach-Mazur unfolded

Sia \(X\) uno [[id:c0d47e62-8d50-44c0-984a-c115c0ea2c40][spazio polacco]] non vuoto con una [[id:59033095-a7ca-4c79-92a9-c93654eb71f3][metrica]] fissata e sia \(\mathcal{W}\) una [[id:65536d5e-4a41-4b05-ad27-2594c896da4d][base debole]] [[id:43e8fa42-e06f-40fa-871f-cbc9b2387484][numerabile]] di \(X\).

*** Definizione 2.10
:PROPERTIES:
:BEAMER_env: block
:END:

Dato \(F \subseteq X\times \omega^{\omega}\), il _gioco di Banach-Mazur unfolded_ \(G^{**}_{\text{u}}(F)\) è il [[id:90b2021f-dbe8-499f-8c79-32379384fdb8][gioco]] [[id:118a42bc-7263-46fd-92c5-85c108080240][di Gale-Stewart]] codificato come segue:
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {U_0} \&\& {U_1} \&\& \dots \\
	{\text{II}} \&\& {y_0,V_0} \&\& {y_1, V_{1}} \& \dots
\end{tikzcd}
\end{equation*}
tali che:
- per ogni \(i \in \omega\): \(U_{i}, V_{i} \in \mathcal{W}\), \(y_{n} \in \omega\);
- \(\operatorname{diam}(U_{n}), \operatorname{diam}(V_{n}) < 2^{-n}\);
- \(U_{0}\supseteq V_{0}\supseteq U_{1}\supseteq V_{1}\supseteq \dots\)\hfill (continua\dots)

** DA TOGLIERE
*** Definizione 2.10
:PROPERTIES:
:BEAMER_env: block
:END:

Posto
\begin{equation*}
\set{x}\coloneqq\bigcap_{i \in \omega} \operatorname{Cl}_{X}(U_{n}) = \bigcap_{i \in \omega} \operatorname{Cl}_{X}(V_{n})
\end{equation*}
e \(y\coloneqq (y_{i})_{i \in \omega} \in \omega^{\omega}\), il _giocatore II vince_ sse
\begin{equation*}
(x,y) \in F \subseteq X\times \omega^{\omega}.
\end{equation*}

*** Lemma 2.11
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Se \(F\) è aperto o chiuso di \(X\times\omega^{\omega}\), allora \(G^{**}_{\text{u}}(F)\) è determinato.

** DA TOGLIERE

*** Teorema 2.12
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Sia \(X\) uno spazio polacco con una metrica fissata e sia \(\mathcal{W}\) una base debole di X.

Dato \(F \subseteq X\times \omega^{\omega}\) si consideri il [[id:a72d8a72-675b-472c-8c55-1d7746778acd][**-gioco]]: \(G^{**}_{\text{u}}(F)\). Indicato con \(A\coloneqq \pi_{X}(F)\):
a. se I ha una [[id:25fecfe5-10ce-4072-bba1-12024479dbca][strategia]] [[id:25fecfe5-10ce-4072-bba1-12024479dbca][vincente]] in \(G^{**}_{\text{u}}(F)\), allora \(A\) è magro in un aperto non vuoto di \(X\);
b. se II ha una [[id:25fecfe5-10ce-4072-bba1-12024479dbca][strategia]] [[id:25fecfe5-10ce-4072-bba1-12024479dbca][vincente]] in \(G^{**}_{\text{u}}(F)\) allora \(A\) è comagro.

** DA TOGLIERE

Dimostrazione teorema 2.12


** Teorema di Lusin-Sierpiński

