Seminario/latex_beamer/slides.tex

\begin{frame}[label={sec:org6ff8b90}]{Gioco di Choquet}
\begin{block}{Definizione 2.1}
Sia \((X,\tau)\) uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} non vuoto. Il gioco di Choquet \(G_{X}\) è un \href{../../../../../../../org/roam/20250513155732-logic_game.org}{gioco} \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{di Gale-Stewart} totale codificato come segue: i giocatori I e II si alternano scegliendo sottoinsiemi aperti non vuoti di \(X\):
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {U_0} \&\& {U_1} \&\& {U_2} \&\& \cdots \\
	{\text{II}} \&\& {V_0} \&\& {V_1} \&\& \cdots
\end{tikzcd}
\end{equation*}
tali che \(U_{0} \supseteq V_{0}\supseteq U_{1}\supseteq V_{1}\supseteq \dots\)

Il giocatore II vince se
\begin{equation*}
\bigcap_{n \in \omega} V_{n} = \bigcap_{n \in \omega} U_{n} \neq \emptyset.
\end{equation*}
\end{block}
\end{frame}
\begin{frame}[label={sec:org8663b73}]{DA TOGLIERE}
\begin{alertblock}{Teorema 2.2}
Uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} \(X\) è uno \href{../../../../../../../org/roam/20250514154101-spazio_topologico_di_baire.org}{spazio topologico di Baire} se e solo se il giocatore I \uline{non ha una \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{strategia} \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{vincente}} nel \href{../../../../../../../org/roam/20250514174255-gioco_di_choquet.org}{gioco di Choquet} \(G_{X}\).
\end{alertblock}
\begin{block}{Definizione 2.3}
Uno spazio topologico \(X\) è detto \uline{spazio di Choquet} se il giocatore II ha una strategia vincente in \(G_{X}\).
\end{block}
\begin{block}{DA TOGLIERE}
In particolare, ogni spazio Polacco è uno spazio di Choquet.
\end{block}
\end{frame}
\begin{frame}[label={sec:org109220f}]{Gioco di Banach-Mazur}
Sia \(X\) uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} non vuoto, e sia \(A \subseteq X\).
\begin{block}{Definizione 2.5}
Il \uline{gioco di Banach-Mazur} (o anche **-gioco) di \(A\), denotato con \(G^{ * *}(A)\) oppure con \(G^{ * *}(A,X)\) è un \href{../../../../../../../org/roam/20250513155732-logic_game.org}{gioco} \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{di Gale-Stewart} codificato come segue: i giocatori I e II si alternano scegliendo sottoinsiemi aperti non vuoti di \(X\)
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {U_0} \&\& {U_1} \&\& {U_2} \&\& \cdots \\
	{\text{II}} \&\& {V_0} \&\& {V_1} \&\& \cdots
\end{tikzcd}
\end{equation*}
\href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{tali che} \(U_{0}\supseteq V_{0}\supseteq U_{1}\supseteq V_{1}\supseteq \dots\)

Il giocatore II vince se
\begin{equation*}
\bigcap_{n \in \omega} U_{n} = \bigcap_{n \in \omega} V_{n} \subseteq A.
\end{equation*}
\end{block}
\end{frame}
\begin{frame}[label={sec:org53ca00e}]{DA TOGLIERE}
\begin{alertblock}{Teorema 2.6}
Sia \(X\) uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} \href{../../../../../../../org/roam/20250131161811-insieme_vuoto_mk.org}{non vuoto}, e sia \(A \subseteq X\) un \href{../../../../../../../org/roam/20250131155822-operazioni_insiemistiche_tra_classi_mk.org}{sottoinsieme} qualsiasi. Allora \(A\) è \href{../../../../../../../org/roam/20250419122752-insieme_magro.org}{comagro} se e solo se il giocatore II ha una \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{strategia vincente} nel \href{../../../../../../../org/roam/20250513111844-gioco_di_banach_mazur.org}{gioco di Banach-Mazur} \(G^{**}(A)\).
\end{alertblock}
\begin{alertblock}{Teorema 2.7}
Se \(X\) è uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} \href{../../../../../../../org/roam/20250514174255-gioco_di_choquet.org}{di Choquet} non \href{../../../../../../../org/roam/20250131161811-insieme_vuoto_mk.org}{vuoto} ed esiste una \href{../../../../../../../org/roam/20250301193511-spazio_metrico.org}{distanza} \(d\) su \(X\) le cui \href{../../../../../../../org/roam/20250301193511-spazio_metrico.org}{palle aperte} sono aperti di \(X\), allora:

\(A\) è \href{../../../../../../../org/roam/20250419122752-insieme_magro.org}{magro} in un \href{../../../../../../../org/roam/20250103145124-topologia.org}{aperto} non vuoto se e solo se il giocatore I ha una \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{strategia vincente} nel \href{../../../../../../../org/roam/20250513111844-gioco_di_banach_mazur.org}{gioco di Banach-Mazur} \(G^{**}(A)\).
\end{alertblock}
\end{frame}
\begin{frame}[label={sec:org74c9e70}]{DA TOGLIERE}
Dimostrazione Teorema 2.6/2.7???
\end{frame}
\begin{frame}[label={sec:org36ff494}]{DA TOGLIERE}
\begin{alertblock}{Lemma 2.8}
Sia \(X\) uno \href{../../../../../../../org/roam/20250103145124-topologia.org}{spazio topologico} \href{../../../../../../../org/roam/20250514174255-gioco_di_choquet.org}{di Choquet} non \href{../../../../../../../org/roam/20250131161811-insieme_vuoto_mk.org}{vuoto} tale che esista una \href{../../../../../../../org/roam/20250301193511-spazio_metrico.org}{distanza} \(d\) su \(X\) le cui \href{../../../../../../../org/roam/20250301193511-spazio_metrico.org}{palle aperte} sono aperti di \(X\). Sia \(A \subseteq X\).

Se per ogni aperto \(U \subseteq X\) il \href{../../../../../../../org/roam/20250513111844-gioco_di_banach_mazur.org}{gioco} \(G^{**}\left((X\setminus A)\cup U\right)\) è \href{../../../../../../../org/roam/20250513155732-logic_game.org}{determinato} allora \(A \subseteq X\) ha \href{../../../../../../../org/roam/20250514154039-proprieta_di_baire.org}{BP}.
\end{alertblock}
\end{frame}
\begin{frame}[label={sec:org51bbdfe}]{DA TOGLIERE}
\begin{block}{Definizione 2.9}
Una \uline{base debole} per uno spazio topologico \((X,\tau)\) è una collezione di aperti \(\set{A_{\alpha}}_{\alpha \in \Omega} \subseteq \tau\) tali che, per ogni aperto non vuoto di \(X\), \(\emptyset\neq U \subseteq X\) esista \(\alpha_{0} \in \Omega\) tale che
\begin{equation*}
A_{\alpha_{0}} \subseteq U.
\end{equation*}
\end{block}
\end{frame}
\begin{frame}[label={sec:org0d40b40}]{Gioco di Banach-Mazur unfolded}
Sia \(X\) uno \href{../../../../../../../org/roam/20250301194013-spazio_polacco.org}{spazio polacco} non vuoto con una \href{../../../../../../../org/roam/20250301193511-spazio_metrico.org}{metrica} fissata e sia \(\mathcal{W}\) una \href{../../../../../../../org/roam/20250525113346-base_debole_di_uno_spazio_topologico.org}{base debole} \href{../../../../../../../org/roam/20250111143651-insieme_numerabile.org}{numerabile} di \(X\).
\begin{block}{Definizione 2.10}
Dato \(F \subseteq X\times \omega^{\omega}\), il \uline{gioco di Banach-Mazur unfolded} \(G^{**}_{\text{u}}(F)\) è il \href{../../../../../../../org/roam/20250513155732-logic_game.org}{gioco} \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{di Gale-Stewart} codificato come segue:
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped,sep=tiny]
	{\text{I}} \& {U_0} \&\& {U_1} \&\& \dots \\
	{\text{II}} \&\& {y_0,V_0} \&\& {y_1, V_{1}} \& \dots
\end{tikzcd}
\end{equation*}
tali che:
\begin{itemize}
\item per ogni \(i \in \omega\): \(U_{i}, V_{i} \in \mathcal{W}\), \(y_{n} \in \omega\);
\item \(\operatorname{diam}(U_{n}), \operatorname{diam}(V_{n}) < 2^{-n}\);
\item \(U_{0}\supseteq V_{0}\supseteq U_{1}\supseteq V_{1}\supseteq \dots\)\hfill (continua\dots{})
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label={sec:org5b7f218}]{DA TOGLIERE}
\begin{block}{Definizione 2.10}
Posto
\begin{equation*}
\set{x}\coloneqq\bigcap_{i \in \omega} \operatorname{Cl}_{X}(U_{n}) = \bigcap_{i \in \omega} \operatorname{Cl}_{X}(V_{n})
\end{equation*}
e \(y\coloneqq (y_{i})_{i \in \omega} \in \omega^{\omega}\), il \uline{giocatore II vince} sse
\begin{equation*}
(x,y) \in F \subseteq X\times \omega^{\omega}.
\end{equation*}
\end{block}
\begin{alertblock}{Lemma 2.11}
Se \(F\) è aperto o chiuso di \(X\times\omega^{\omega}\), allora \(G^{**}_{\text{u}}(F)\) è determinato.
\end{alertblock}
\end{frame}
\begin{frame}[label={sec:org857017c}]{DA TOGLIERE}
\begin{alertblock}{Teorema 2.12}
Sia \(X\) uno spazio polacco con una metrica fissata e sia \(\mathcal{W}\) una base debole di X.

Dato \(F \subseteq X\times \omega^{\omega}\) si consideri il \href{../../../../../../../org/roam/20250513111844-gioco_di_banach_mazur.org}{**-gioco}: \(G^{**}_{\text{u}}(F)\). Indicato con \(A\coloneqq \pi_{X}(F)\):
\begin{enumerate}
\item se I ha una \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{strategia} \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{vincente} in \(G^{**}_{\text{u}}(F)\), allora \(A\) è magro in un aperto non vuoto di \(X\);
\item se II ha una \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{strategia} \href{../../../../../../../org/roam/20250513171520-giochi_di_gale_stewart.org}{vincente} in \(G^{**}_{\text{u}}(F)\) allora \(A\) è comagro.
\end{enumerate}
\end{alertblock}
\end{frame}
\begin{frame}[label={sec:org223aa91}]{DA TOGLIERE}
Dimostrazione teorema 2.12
\end{frame}
