Seminario/latex_beamer/slides.org
*** Teorema di Lusin-Sierpiński 2.13
:PROPERTIES:
:BEAMER_env: alertblock
:END:

Sia \(X\) uno [[id:c0d47e62-8d50-44c0-984a-c115c0ea2c40][spazio polacco]]. Allora ogni [[id:648c8718-f653-4932-9c00-900d90560720][insieme analitico]] di \(X\) ha la [[id:a18bc557-1ac7-4d19-8cd8-ad3923e1a68f][Baire Property]].

*** Dimostrazione
:PROPERTIES:
:BEAMER_env: proof
:END:

Siccome \(\mathrm{BP}(X)\) è una [[id:75242464-a48e-4c0d-a56b-0cb5b3215ee2][\(\sigma\)-algebra]] allora è chiusa per complementi, e pertanto se ogni insieme coanalitico ha BP allora si è dimostrata la tesi.

Sia dunque \(C\) un insieme coanalitico e sia \(U \subseteq X\) un aperto. Posto \(A\coloneqq (X\setminus C)\cup U\), questo è un insieme analitico, e pertanto  esiste un chiuso \(F \subseteq X\times\omega^{\omega}\) tale che \(A=\pi_{X}(F)\).

Per il [[id:3c4f7c3f-7f63-4d59-9240-0c60d79e42ad][Teorema di Gale-Stewart]] 1.7 (e per il Lemma 2.11), allora, il [[id:a72d8a72-675b-472c-8c55-1d7746778acd][**-gioco \(G^{ * *}_{\text{u}}(F)\)]] è [[id:2f1132b9-a68c-42dc-b889-f9ea0565677f][determinato]], ed in particolare vale una tra le condizioni 1. e 2. del Teorema 2.12.

Per i [[id:8d136b11-9afd-48e7-aea3-dcc74393aff8][Teoremi]] 2.26 e 2.27, allora, il [[id:00eb3064-f9f9-47c4-9eac-473caaf438a7][gioco \(G^{**}(A) = G^{ * *}\left((X\setminus C) \cup U\right)\)]] è determinato: per il Lemma 2.8, quindi \(C\) ha la BP.

* \null

** Bibliografia minimale
\nocite{*}
\printbibliography
