Seminario/latex_beamer/slides.tex
\begin{frame}[label={sec:org4097097}]{Teorema di Lusin-Sierpiński}
\begin{alertblock}{Teorema di Lusin-Sierpiński 2.13}
Sia \(X\) uno \href{../../../../../../../org/roam/20250301194013-spazio_polacco.org}{spazio polacco}. Allora ogni \href{../../../../../../../org/roam/20250525220742-insieme_analitico.org}{insieme analitico} di \(X\) ha la \href{../../../../../../../org/roam/20250514154039-proprieta_di_baire.org}{Baire Property}.
\end{alertblock}
\begin{proof}[Dimostrazione]
Siccome \(\mathrm{BP}(X)\) è una \href{../../../../../../../org/roam/20250526100313-sigma_algebra.org}{\(\sigma\)-algebra} allora è chiusa per complementi, e pertanto se ogni insieme coanalitico ha BP allora si è dimostrata la tesi.

Sia dunque \(C\) un insieme coanalitico e sia \(U \subseteq X\) un aperto. Posto \(A\coloneqq (X\setminus C)\cup U\), questo è un insieme analitico, e pertanto  esiste un chiuso \(F \subseteq X\times\omega^{\omega}\) tale che \(A=\pi_{X}(F)\).

Per il \href{../../../../../../../org/roam/20250514144736-teorema_di_gale_stewart.org}{Teorema di Gale-Stewart} 1.7 (e per il Lemma 2.11), allora, il \href{../../../../../../../org/roam/20250513111844-gioco_di_banach_mazur.org}{**-gioco \(G^{ * *}_{\text{u}}(F)\)} è \href{../../../../../../../org/roam/20250513155732-logic_game.org}{determinato}, ed in particolare vale una tra le condizioni 1. e 2. del Teorema 2.12.

Per i \href{../../../../../../../org/roam/20250514174717-teorema_di_caratterizzazione_dei_comagri_tramite_il_gioco_di_banach_mazur.org}{Teoremi} 2.26 e 2.27, allora, il \href{../../../../../../../org/roam/20250513111844-gioco_di_banach_mazur.org}{gioco \(G^{**}(A) = G^{ * *}\left((X\setminus C) \cup U\right)\)} è determinato: per il Lemma 2.8, quindi \(C\) ha la BP.
\end{proof}
\end{frame}
\section{\null}
\label{sec:orgc3d4485}

\begin{frame}[label={sec:org2d74e23}]{Bibliografia minimale}
\nocite{*}
\printbibliography
\end{frame}
\end{document}
